error_messages = {
            400: "API-ключ не найден или недействителен.",
            429: "Превышен лимит запросов. Повтор через минуту.",
            401: "Неавторизован. Проверьте ваш API-ключ.",
            403: "Доступ запрещен. Проверьте права доступа или ваш API-ключ.",
            404: "Ресурс не найден. Проверьте URL.",
            500: "Ошибка на сервере. Попробуйте позже.",
            502: "Ошибка шлюза. Попробуйте позже.",
            503: "Сервис временно недоступен. Попробуйте позже.",
            504: "Тайм-аут шлюза. Попробуйте позже.",
            302: "Перенаправление: Запрашиваемый ресурс временно перемещен. Проверьте новый URL в заголовках ответа."
        }